# command-line utilities
brew "python"
brew "miniconda"
brew "tree"
brew "neovim"
brew "git"
brew "lazygit"
brew "lazydocker"
brew "fzf"
brew "eza"
brew "mysql"
brew "bat"
brew "ollama"
brew "zoxide"
brew "thefuck"
brew "tldr"
brew "git-lfs"
brew "uv"
brew "ruff"
brew "fastfetch"
brew "tmux"
brew "btop"
brew "htop"

# Applications

# Social
cask "discord"
cask "whatsapp"
cask "zoom"
cask "slack"
cask "telegram-desktop"
cask "obs"

# Tools/Utilities
cask "linearmouse"
cask "android-file-transfer"
cask "android-platform-tools"
cask "ente-auth"
cask "proton-pass"
cask "maccy"
cask "raycast"
cask "rectangle"
cask "anydesk"
cask "keka"
cask "monitorcontrol"
cask "clop"
cask "hiddenbar"
cask "appcleaner"
cask "mac-mouse-fix"
cask "shottr"

# Development
cask "visual-studio-code"
cask "pycharm-ce"
cask "warp"
cask "rstudio"
cask "mysqlworkbench"
cask "miniconda"
cask "github"
cask "cursor"
cask "docker"

# Sharing
cask "localsend"
cask "blip"

# Entertainment
cask "iina"

# Education
cask "notion"
cask "todoist"

# Browsers
cask "brave-browser"
cask "google-chrome"
cask "firefox"

# GPTs
cask "chatgpt"
cask "claude"